In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [8]:
np.random.seed(100)

In [22]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [23]:
df

          W         X         Y         Z
A  2.527071 -0.736815  0.249914 -0.407202
B -0.528333  0.700045  0.074560 -0.091808
C -0.810560  1.999858 -0.790473  1.272035
D  0.123407 -0.144720  0.063400  0.031048
E -1.739099  0.086494 -0.491046 -2.674355

In [29]:
booldf=df>0

In [31]:
booldf

       W      X      Y      Z
A   True  False   True  False
B  False   True   True  False
C  False   True  False   True
D   True  False   True   True
E  False   True  False  False

In [32]:
df[booldf]

          W         X         Y         Z
A  2.527071       NaN  0.249914       NaN
B       NaN  0.700045  0.074560       NaN
C       NaN  1.999858       NaN  1.272035
D  0.123407       NaN  0.063400  0.031048
E       NaN  0.086494       NaN       NaN

In [33]:
df[df>0]

          W         X         Y         Z
A  2.527071       NaN  0.249914       NaN
B       NaN  0.700045  0.074560       NaN
C       NaN  1.999858       NaN  1.272035
D  0.123407       NaN  0.063400  0.031048
E       NaN  0.086494       NaN       NaN

In [35]:
df['W']>0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [36]:
df['W']

A    2.527071
B   -0.528333
C   -0.810560
D    0.123407
E   -1.739099
Name: W, dtype: float64

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  2.527071 -0.736815  0.249914 -0.407202
D  0.123407 -0.144720  0.063400  0.031048

In [49]:
resultdf=df[df['X']>0]
resultdf

          W         X         Y         Z
B -0.528333  0.700045  0.074560 -0.091808
C -0.810560  1.999858 -0.790473  1.272035
E -1.739099  0.086494 -0.491046 -2.674355

In [50]:
resultdf['X']

B    0.700045
C    1.999858
E    0.086494
Name: X, dtype: float64

In [52]:
df[df['X']>0]['X']

B    0.700045
C    1.999858
E    0.086494
Name: X, dtype: float64

In [67]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.249914 -0.736815
D  0.063400 -0.144720

In [68]:
boolser=df['W']>0
result=df[boolser]

In [69]:
mycols=['Y','X']
result[mycols]

          Y         X
A  0.249914 -0.736815
D  0.063400 -0.144720

In [73]:
df[(df['W']>0) & (df['Z']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [74]:
df[(df['W']>0) & (df['Z']>0)]

          W        X       Y         Z
D  0.123407 -0.14472  0.0634  0.031048

In [78]:
df[(df['W']>0) | (df['Z']>1)]

          W         X         Y         Z
A  2.527071 -0.736815  0.249914 -0.407202
C -0.810560  1.999858 -0.790473  1.272035
D  0.123407 -0.144720  0.063400  0.031048

In [79]:
df

          W         X         Y         Z
A  2.527071 -0.736815  0.249914 -0.407202
B -0.528333  0.700045  0.074560 -0.091808
C -0.810560  1.999858 -0.790473  1.272035
D  0.123407 -0.144720  0.063400  0.031048
E -1.739099  0.086494 -0.491046 -2.674355

In [81]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.527071 -0.736815  0.249914 -0.407202
1     B -0.528333  0.700045  0.074560 -0.091808
2     C -0.810560  1.999858 -0.790473  1.272035
3     D  0.123407 -0.144720  0.063400  0.031048
4     E -1.739099  0.086494 -0.491046 -2.674355

In [83]:
newind='CA NY WY OR CP'.split()

In [84]:
newind

['CA', 'NY', 'WY', 'OR', 'CP']

In [85]:
df['states']=newind

In [86]:
df

          W         X         Y         Z states
A  2.527071 -0.736815  0.249914 -0.407202     CA
B -0.528333  0.700045  0.074560 -0.091808     NY
C -0.810560  1.999858 -0.790473  1.272035     WY
D  0.123407 -0.144720  0.063400  0.031048     OR
E -1.739099  0.086494 -0.491046 -2.674355     CP

In [87]:
df.reset_index()

  index         W         X         Y         Z states
0     A  2.527071 -0.736815  0.249914 -0.407202     CA
1     B -0.528333  0.700045  0.074560 -0.091808     NY
2     C -0.810560  1.999858 -0.790473  1.272035     WY
3     D  0.123407 -0.144720  0.063400  0.031048     OR
4     E -1.739099  0.086494 -0.491046 -2.674355     CP

In [88]:
df.set_index('states')

               W         X         Y         Z
states
CA      2.527071 -0.736815  0.249914 -0.407202
NY     -0.528333  0.700045  0.074560 -0.091808
WY     -0.810560  1.999858 -0.790473  1.272035
OR      0.123407 -0.144720  0.063400  0.031048
CP     -1.739099  0.086494 -0.491046 -2.674355